In [90]:
#outlier detection and removal
#for eg: age 1000 in a dataset of people's ages

In [96]:
import pandas as pd

df = pd.read_csv('heights.csv')

In [97]:
df.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [98]:
max_threshold = df['height'].quantile(0.95)
#this means 9.68ft is 95 percent quantile

In [99]:
min_threshold = df['height'].quantile(0.05)
#this means 3.65ft is 5 percent quantile
#above this and below this is an outlier

In [100]:
df[df['height']>max_threshold]

    name  height
9  imran    14.5

In [101]:
df[df['height']<min_threshold]

      name  height
12  yoseph     1.2

In [102]:
 new_df = df[(df['height']<max_threshold) & (df['height']>min_threshold)]

In [103]:
new_df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [104]:
#now practicing on a bigger and complex dataset
data = pd.read_csv('bhp.csv')

In [105]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [106]:
data.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [118]:
min_thresh, max_thresh = data.price_per_sqft.quantile([0.001, 0.999])
min_thresh, max_thresh

(1366.184, 50959.36200000098)

In [114]:
new_data = data[(data.price_per_sqft>min_thresh) & (data.price_per_sqft<max_thresh)]
new_data.shape

(13172, 7)